{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 50,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              4
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 30,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true,
            "batch_input_shape": [
              null,
              50
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 3,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 3.15.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "dense_Dense1/kernel",
          "shape": [
            4,
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/bias",
          "shape": [
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/kernel",
          "shape": [
            50,
            30
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/bias",
          "shape": [
            30
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense3/kernel",
          "shape": [
            30,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense3/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "iter",
          "shape": [],
          "dtype": "int32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense1/kernel/m",
          "shape": [
            4,
            50
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense1/bias/m",
          "shape": [
            50
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense2/kernel/m",
          "shape": [
            50,
            30
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense2/bias/m",
          "shape": [
            30
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense3/kernel/m",
          "shape": [
            30,
            3
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense3/bias/m",
          "shape": [
            3
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense1/kernel/v",
          "shape": [
            4,
            50
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense1/bias/v",
          "shape": [
            50
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense2/kernel/v",
          "shape": [
            50,
            30
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense2/bias/v",
          "shape": [
            30
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense3/kernel/v",
          "shape": [
            30,
            3
          ],
          "dtype": "float32",
          "group": "optimizer"
        },
        {
          "name": "dense_Dense3/bias/v",
          "shape": [
            3
          ],
          "dtype": "float32",
          "group": "optimizer"
        }
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v3.15.0",
  "convertedBy": null,
  "trainingConfig": {
    "loss": "mean_squared_error",
    "metrics": {},
    "optimizer_config": {
      "class_name": "Adam",
      "config": {
        "learningRate": 0.06,
        "beta1": 0.9,
        "beta2": 0.999,
        "epsilon": 1e-7
      }
    }
  }
}